{
  "architectures": ["ViTForImageClassification"],
  "model_type": "vit",
  "hidden_size": 1280,
  "num_attention_heads": 16,
  "num_key_value_heads": 16,
  "intermediate_size": 5120,
  "num_hidden_layers": 32,
  "vocab_size": 1000,
  "image_size": 224,
  "patch_size": 14
}
