{
  "architectures": ["ViTForImageClassification"],
  "model_type": "vit",
  "hidden_size": 1024,
  "num_attention_heads": 16,
  "num_key_value_heads": 16,
  "intermediate_size": 4096,
  "num_hidden_layers": 24,
  "vocab_size": 1000,
  "image_size": 224,
  "patch_size": 16
}
